ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h

#ifndef STM32H7X3_H
#define STM32H7X3_H

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#ifdef __cplusplus
  #define   __I      volatile
#else
  #define   __I      volatile const
#endif
#define     __O      volatile
#define     __IO     volatile

#define     __IM     volatile const
#define     __OM     volatile
#define     __IOM    volatile

/* =========================================================================================================================== */
/* ================                                            RCC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset and clock control (RCC)
  */

typedef struct {                                /*!< (@ 0x58024400) RCC Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) clock control register                                     */
    
    struct {
      __IOM uint32_t HSION      : 1;            /*!< [0..0] Internal high-speed clock enable                                   */
      __IOM uint32_t HSIKERON   : 1;            /*!< [1..1] High Speed Internal clock enable in Stop mode                      */
      __IOM uint32_t HSIRDY     : 1;            /*!< [2..2] HSI clock ready flag                                               */
      __IOM uint32_t HSIDIV     : 2;            /*!< [4..3] HSI clock divider                                                  */
      __IOM uint32_t HSIDIVF    : 1;            /*!< [5..5] HSI divider flag                                                   */
            uint32_t            : 1;
      __IOM uint32_t CSION      : 1;            /*!< [7..7] CSI clock enable                                                   */
      __IOM uint32_t CSIRDY     : 1;            /*!< [8..8] CSI clock ready flag                                               */
      __IOM uint32_t CSIKERON   : 1;            /*!< [9..9] CSI clock enable in Stop mode                                      */
            uint32_t            : 2;
      __IOM uint32_t RC48ON     : 1;            /*!< [12..12] RC48 clock enable                                                */
      __IOM uint32_t RC48RDY    : 1;            /*!< [13..13] RC48 clock ready flag                                            */
      __IOM uint32_t D1CKRDY    : 1;            /*!< [14..14] D1 domain clocks ready flag                                      */
      __IOM uint32_t D2CKRDY    : 1;            /*!< [15..15] D2 domain clocks ready flag                                      */
      __IOM uint32_t HSEON      : 1;            /*!< [16..16] HSE clock enable                                                 */
      __IOM uint32_t HSERDY     : 1;            /*!< [17..17] HSE clock ready flag                                             */
      __IOM uint32_t HSEBYP     : 1;            /*!< [18..18] HSE clock bypass                                                 */
      __IOM uint32_t HSECSSON   : 1;            /*!< [19..19] HSE Clock Security System enable                                 */
            uint32_t            : 4;
      __IOM uint32_t PLL1ON     : 1;            /*!< [24..24] PLL1 enable                                                      */
      __IOM uint32_t PLL1RDY    : 1;            /*!< [25..25] PLL1 clock ready flag                                            */
      __IOM uint32_t PLL2ON     : 1;            /*!< [26..26] PLL2 enable                                                      */
      __IOM uint32_t PLL2RDY    : 1;            /*!< [27..27] PLL2 clock ready flag                                            */
      __IOM uint32_t PLL3ON     : 1;            /*!< [28..28] PLL3 enable                                                      */
      __IOM uint32_t PLL3RDY    : 1;            /*!< [29..29] PLL3 clock ready flag                                            */
            uint32_t            : 2;
    } bit;
  } CR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) RCC Internal Clock Source Calibration Register             */
    
    struct {
      __IM  uint32_t HSICAL     : 12;           /*!< [11..0] HSI clock calibration                                             */
      __IOM uint32_t HSITRIM    : 6;            /*!< [17..12] HSI clock trimming                                               */
      __IM  uint32_t CSICAL     : 8;            /*!< [25..18] CSI clock calibration                                            */
      __IOM uint32_t CSITRIM    : 5;            /*!< [30..26] CSI clock trimming                                               */
            uint32_t            : 1;
    } bit;
  } ICSCR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000008) RCC Clock Recovery RC Register                             */
    
    struct {
      __IM  uint32_t RC48CAL    : 10;           /*!< [9..0] Internal RC 48 MHz clock calibration                               */
            uint32_t            : 22;
    } bit;
  } CRRCR;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) RCC Clock Configuration Register                           */
    
    struct {
      __IOM uint32_t SW         : 3;            /*!< [2..0] System clock switch                                                */
      __IOM uint32_t SWS        : 3;            /*!< [5..3] System clock switch status                                         */
      __IOM uint32_t STOPWUCK   : 1;            /*!< [6..6] System clock selection after a wake up from system Stop            */
      __IOM uint32_t STOPKERWUCK : 1;           /*!< [7..7] Kernel clock selection after a wake up from system Stop            */
      __IOM uint32_t RTCPRE     : 6;            /*!< [13..8] HSE division factor for RTC clock                                 */
      __IOM uint32_t HRTIMSEL   : 1;            /*!< [14..14] High Resolution Timer clock prescaler selection                  */
      __IOM uint32_t TIMPRE     : 1;            /*!< [15..15] Timers clocks prescaler selection                                */
            uint32_t            : 2;
      __IOM uint32_t MCO1PRE    : 4;            /*!< [21..18] MCO1 prescaler                                                   */
      __IOM uint32_t MCO1SEL    : 3;            /*!< [24..22] Micro-controller clock output 1                                  */
      __IOM uint32_t MCO2PRE    : 4;            /*!< [28..25] MCO2 prescaler                                                   */
      __IOM uint32_t MCO2SEL    : 3;            /*!< [31..29] Micro-controller clock output 2                                  */
    } bit;
  } CFGR;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) RCC Domain 1 Clock Configuration Register                  */
    
