ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h
    struct {
      __IOM uint32_t HPRE       : 4;            /*!< [3..0] D1 domain AHB prescaler                                            */
      __IOM uint32_t D1PPRE     : 3;            /*!< [6..4] D1 domain APB3 prescaler                                           */
            uint32_t            : 1;
      __IOM uint32_t D1CPRE     : 4;            /*!< [11..8] D1 domain Core prescaler                                          */
            uint32_t            : 20;
    } bit;
  } D1CFGR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) RCC Domain 2 Clock Configuration Register                  */
    
    struct {
            uint32_t            : 4;
      __IOM uint32_t D2PPRE1    : 3;            /*!< [6..4] D2 domain APB1 prescaler                                           */
            uint32_t            : 1;
      __IOM uint32_t D2PPRE2    : 3;            /*!< [10..8] D2 domain APB2 prescaler                                          */
            uint32_t            : 21;
    } bit;
  } D2CFGR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) RCC Domain 3 Clock Configuration Register                  */
    
    struct {
            uint32_t            : 4;
      __IOM uint32_t D3PPRE     : 3;            /*!< [6..4] D3 domain APB4 prescaler                                           */
            uint32_t            : 25;
    } bit;
  } D3CFGR;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) RCC PLLs Clock Source Selection Register                   */
    
    struct {
      __IOM uint32_t PLLSRC     : 2;            /*!< [1..0] DIVMx and PLLs clock source selection                              */
            uint32_t            : 2;
      __IOM uint32_t DIVM1      : 6;            /*!< [9..4] Prescaler for PLL1                                                 */
            uint32_t            : 2;
      __IOM uint32_t DIVM2      : 6;            /*!< [17..12] Prescaler for PLL2                                               */
            uint32_t            : 2;
      __IOM uint32_t DIVM3      : 6;            /*!< [25..20] Prescaler for PLL3                                               */
            uint32_t            : 6;
    } bit;
  } PLLCKSELR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) RCC PLLs Configuration Register                            */
    
    struct {
      __IOM uint32_t PLL1FRACEN : 1;            /*!< [0..0] PLL1 fractional latch enable                                       */
      __IOM uint32_t PLL1VCOSEL : 1;            /*!< [1..1] PLL1 VCO selection                                                 */
      __IOM uint32_t PLL1RGE    : 2;            /*!< [3..2] PLL1 input frequency range                                         */
      __IOM uint32_t PLL2FRACEN : 1;            /*!< [4..4] PLL2 fractional latch enable                                       */
      __IOM uint32_t PLL2VCOSEL : 1;            /*!< [5..5] PLL2 VCO selection                                                 */
      __IOM uint32_t PLL2RGE    : 2;            /*!< [7..6] PLL2 input frequency range                                         */
      __IOM uint32_t PLL3FRACEN : 1;            /*!< [8..8] PLL3 fractional latch enable                                       */
      __IOM uint32_t PLL3VCOSEL : 1;            /*!< [9..9] PLL3 VCO selection                                                 */
      __IOM uint32_t PLL3RGE    : 2;            /*!< [11..10] PLL3 input frequency range                                       */
            uint32_t            : 4;
      __IOM uint32_t DIVP1EN    : 1;            /*!< [16..16] PLL1 DIVP divider output enable                                  */
      __IOM uint32_t DIVQ1EN    : 1;            /*!< [17..17] PLL1 DIVQ divider output enable                                  */
      __IOM uint32_t DIVR1EN    : 1;            /*!< [18..18] PLL1 DIVR divider output enable                                  */
      __IOM uint32_t DIVP2EN    : 1;            /*!< [19..19] PLL2 DIVP divider output enable                                  */
      __IOM uint32_t DIVQ2EN    : 1;            /*!< [20..20] PLL2 DIVQ divider output enable                                  */
      __IOM uint32_t DIVR2EN    : 1;            /*!< [21..21] PLL2 DIVR divider output enable                                  */
      __IOM uint32_t DIVP3EN    : 1;            /*!< [22..22] PLL3 DIVP divider output enable                                  */
      __IOM uint32_t DIVQ3EN    : 1;            /*!< [23..23] PLL3 DIVQ divider output enable                                  */
      __IOM uint32_t DIVR3EN    : 1;            /*!< [24..24] PLL3 DIVR divider output enable                                  */
            uint32_t            : 7;
    } bit;
  } PLLCFGR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) RCC PLL1 Dividers Configuration Register                   */
    
    struct {
      __IOM uint32_t DIVN1      : 9;            /*!< [8..0] Multiplication factor for PLL1 VCO                                 */
      __IOM uint32_t DIVP1      : 7;            /*!< [15..9] PLL1 DIVP division factor                                         */
      __IOM uint32_t DIVQ1      : 7;            /*!< [22..16] PLL1 DIVQ division factor                                        */
            uint32_t            : 1;
      __IOM uint32_t DIVR1      : 7;            /*!< [30..24] PLL1 DIVR division factor                                        */
            uint32_t            : 1;
    } bit;
  } PLL1DIVR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) RCC PLL1 Fractional Divider Register                       */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t FRACN1     : 13;           /*!< [15..3] Fractional part of the multiplication factor for PLL1
                                                     VCO                                                                       */
            uint32_t            : 16;
    } bit;
  } PLL1FRACR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) RCC PLL2 Dividers Configuration Register                   */
    
