ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h
    struct {
      __IOM uint32_t DIVN1      : 9;            /*!< [8..0] Multiplication factor for PLL1 VCO                                 */
      __IOM uint32_t DIVP1      : 7;            /*!< [15..9] PLL1 DIVP division factor                                         */
      __IOM uint32_t DIVQ1      : 7;            /*!< [22..16] PLL1 DIVQ division factor                                        */
            uint32_t            : 1;
      __IOM uint32_t DIVR1      : 7;            /*!< [30..24] PLL1 DIVR division factor                                        */
            uint32_t            : 1;
    } bit;
  } PLL2DIVR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) RCC PLL2 Fractional Divider Register                       */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t FRACN2     : 13;           /*!< [15..3] Fractional part of the multiplication factor for PLL
                                                     VCO                                                                       */
            uint32_t            : 16;
    } bit;
  } PLL2FRACR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) RCC PLL3 Dividers Configuration Register                   */
    
    struct {
      __IOM uint32_t DIVN3      : 9;            /*!< [8..0] Multiplication factor for PLL1 VCO                                 */
      __IOM uint32_t DIVP3      : 7;            /*!< [15..9] PLL DIVP division factor                                          */
      __IOM uint32_t DIVQ3      : 7;            /*!< [22..16] PLL DIVQ division factor                                         */
            uint32_t            : 1;
      __IOM uint32_t DIVR3      : 7;            /*!< [30..24] PLL DIVR division factor                                         */
            uint32_t            : 1;
    } bit;
  } PLL3DIVR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) RCC PLL3 Fractional Divider Register                       */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t FRACN3     : 13;           /*!< [15..3] Fractional part of the multiplication factor for PLL3
                                                     VCO                                                                       */
            uint32_t            : 16;
    } bit;
  } PLL3FRACR;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) RCC Domain 1 Kernel Clock Configuration Register           */
    
    struct {
      __IOM uint32_t FMCSRC     : 2;            /*!< [1..0] FMC kernel clock source selection                                  */
            uint32_t            : 2;
      __IOM uint32_t QSPISRC    : 2;            /*!< [5..4] QUADSPI kernel clock source selection                              */
            uint32_t            : 10;
      __IOM uint32_t SDMMCSRC   : 1;            /*!< [16..16] SDMMC kernel clock source selection                              */
            uint32_t            : 11;
      __IOM uint32_t CKPERSRC   : 2;            /*!< [29..28] per_ck clock source selection                                    */
            uint32_t            : 2;
    } bit;
  } D1CCIPR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) RCC Domain 2 Kernel Clock Configuration Register           */
    
    struct {
      __IOM uint32_t SAI1SRC    : 3;            /*!< [2..0] SAI1 and DFSDM1 kernel Aclk clock source selection                 */
            uint32_t            : 3;
      __IOM uint32_t SAI23SRC   : 3;            /*!< [8..6] SAI2 and SAI3 kernel clock source selection                        */
            uint32_t            : 3;
      __IOM uint32_t SPI123SRC  : 3;            /*!< [14..12] SPI/I2S1,2 and 3 kernel clock source selection                   */
            uint32_t            : 1;
      __IOM uint32_t SPI45SRC   : 3;            /*!< [18..16] SPI4 and 5 kernel clock source selection                         */
            uint32_t            : 1;
      __IOM uint32_t SPDIFSRC   : 2;            /*!< [21..20] SPDIFRX kernel clock source selection                            */
            uint32_t            : 2;
      __IOM uint32_t DFSDM1SRC  : 1;            /*!< [24..24] DFSDM1 kernel Clk clock source selection                         */
            uint32_t            : 3;
      __IOM uint32_t FDCANSRC   : 2;            /*!< [29..28] FDCAN kernel clock source selection                              */
            uint32_t            : 1;
      __IOM uint32_t SWPSRC     : 1;            /*!< [31..31] SWPMI kernel clock source selection                              */
    } bit;
  } D2CCIP1R;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) RCC Domain 2 Kernel Clock Configuration Register           */
    
    struct {
      __IOM uint32_t USART234578SRC : 3;        /*!< [2..0] USART2/3, UART4,5, 7/8 (APB1) kernel clock source selection        */
      __IOM uint32_t USART16SRC : 3;            /*!< [5..3] USART1 and 6 kernel clock source selection                         */
            uint32_t            : 2;
      __IOM uint32_t RNGSRC     : 2;            /*!< [9..8] RNG kernel clock source selection                                  */
            uint32_t            : 2;
      __IOM uint32_t I2C123SRC  : 2;            /*!< [13..12] I2C1,2,3 kernel clock source selection                           */
            uint32_t            : 6;
      __IOM uint32_t USBSRC     : 2;            /*!< [21..20] USBOTG 1 and 2 kernel clock source selection                     */
      __IOM uint32_t CECSRC     : 2;            /*!< [23..22] HDMI-CEC kernel clock source selection                           */
            uint32_t            : 4;
      __IOM uint32_t LPTIM1SRC  : 3;            /*!< [30..28] LPTIM1 kernel clock source selection                             */
            uint32_t            : 1;
    } bit;
  } D2CCIP2R;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000058) RCC Domain 3 Kernel Clock Configuration Register           */
    
