ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h
    struct {
      __IOM uint32_t LPUART1SRC : 3;            /*!< [2..0] LPUART1 kernel clock source selection                              */
            uint32_t            : 5;
      __IOM uint32_t I2C4SRC    : 2;            /*!< [9..8] I2C4 kernel clock source selection                                 */
      __IOM uint32_t LPTIM2SRC  : 3;            /*!< [12..10] LPTIM2 kernel clock source selection                             */
      __IOM uint32_t LPTIM345SRC : 3;           /*!< [15..13] LPTIM3,4,5 kernel clock source selection                         */
      __IOM uint32_t ADCSRC     : 2;            /*!< [17..16] SAR ADC kernel clock source selection                            */
            uint32_t            : 3;
      __IOM uint32_t SAI4ASRC   : 3;            /*!< [23..21] Sub-Block A of SAI4 kernel clock source selection                */
      __IOM uint32_t SAI4BSRC   : 3;            /*!< [26..24] Sub-Block B of SAI4 kernel clock source selection                */
            uint32_t            : 1;
      __IOM uint32_t SPI6SRC    : 3;            /*!< [30..28] SPI6 kernel clock source selection                               */
            uint32_t            : 1;
    } bit;
  } D3CCIPR;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) RCC Clock Source Interrupt Enable Register                 */
    
    struct {
      __IOM uint32_t LSIRDYIE   : 1;            /*!< [0..0] LSI ready Interrupt Enable                                         */
      __IOM uint32_t LSERDYIE   : 1;            /*!< [1..1] LSE ready Interrupt Enable                                         */
      __IOM uint32_t HSIRDYIE   : 1;            /*!< [2..2] HSI ready Interrupt Enable                                         */
      __IOM uint32_t HSERDYIE   : 1;            /*!< [3..3] HSE ready Interrupt Enable                                         */
      __IOM uint32_t CSIRDYIE   : 1;            /*!< [4..4] CSI ready Interrupt Enable                                         */
      __IOM uint32_t RC48RDYIE  : 1;            /*!< [5..5] RC48 ready Interrupt Enable                                        */
      __IOM uint32_t PLL1RDYIE  : 1;            /*!< [6..6] PLL1 ready Interrupt Enable                                        */
      __IOM uint32_t PLL2RDYIE  : 1;            /*!< [7..7] PLL2 ready Interrupt Enable                                        */
      __IOM uint32_t PLL3RDYIE  : 1;            /*!< [8..8] PLL3 ready Interrupt Enable                                        */
      __IOM uint32_t LSECSSIE   : 1;            /*!< [9..9] LSE clock security system Interrupt Enable                         */
            uint32_t            : 22;
    } bit;
  } CIER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) RCC Clock Source Interrupt Flag Register                   */
    
    struct {
      __IOM uint32_t LSIRDYF    : 1;            /*!< [0..0] LSI ready Interrupt Flag                                           */
      __IOM uint32_t LSERDYF    : 1;            /*!< [1..1] LSE ready Interrupt Flag                                           */
      __IOM uint32_t HSIRDYF    : 1;            /*!< [2..2] HSI ready Interrupt Flag                                           */
      __IOM uint32_t HSERDYF    : 1;            /*!< [3..3] HSE ready Interrupt Flag                                           */
      __IOM uint32_t CSIRDY     : 1;            /*!< [4..4] CSI ready Interrupt Flag                                           */
      __IOM uint32_t RC48RDYF   : 1;            /*!< [5..5] RC48 ready Interrupt Flag                                          */
      __IOM uint32_t PLL1RDYF   : 1;            /*!< [6..6] PLL1 ready Interrupt Flag                                          */
      __IOM uint32_t PLL2RDYF   : 1;            /*!< [7..7] PLL2 ready Interrupt Flag                                          */
      __IOM uint32_t PLL3RDYF   : 1;            /*!< [8..8] PLL3 ready Interrupt Flag                                          */
      __IOM uint32_t LSECSSF    : 1;            /*!< [9..9] LSE clock security system Interrupt Flag                           */
      __IOM uint32_t HSECSSF    : 1;            /*!< [10..10] HSE clock security system Interrupt Flag                         */
            uint32_t            : 21;
    } bit;
  } CIFR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) RCC Clock Source Interrupt Clear Register                  */
    
    struct {
      __IOM uint32_t LSIRDYC    : 1;            /*!< [0..0] LSI ready Interrupt Clear                                          */
      __IOM uint32_t LSERDYC    : 1;            /*!< [1..1] LSE ready Interrupt Clear                                          */
      __IOM uint32_t HSIRDYC    : 1;            /*!< [2..2] HSI ready Interrupt Clear                                          */
      __IOM uint32_t HSERDYC    : 1;            /*!< [3..3] HSE ready Interrupt Clear                                          */
      __IOM uint32_t HSE_ready_Interrupt_Clear : 1;/*!< [4..4] CSI ready Interrupt Clear                                       */
      __IOM uint32_t RC48RDYC   : 1;            /*!< [5..5] RC48 ready Interrupt Clear                                         */
      __IOM uint32_t PLL1RDYC   : 1;            /*!< [6..6] PLL1 ready Interrupt Clear                                         */
      __IOM uint32_t PLL2RDYC   : 1;            /*!< [7..7] PLL2 ready Interrupt Clear                                         */
      __IOM uint32_t PLL3RDYC   : 1;            /*!< [8..8] PLL3 ready Interrupt Clear                                         */
      __IOM uint32_t LSECSSC    : 1;            /*!< [9..9] LSE clock security system Interrupt Clear                          */
      __IOM uint32_t HSECSSC    : 1;            /*!< [10..10] HSE clock security system Interrupt Clear                        */
            uint32_t            : 21;
    } bit;
  } CICR;
  __IM  uint32_t  RESERVED5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) RCC Backup Domain Control Register                         */
    
