ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h
    struct {
      __IOM uint32_t LSEON      : 1;            /*!< [0..0] LSE oscillator enabled                                             */
      __IOM uint32_t LSERDY     : 1;            /*!< [1..1] LSE oscillator ready                                               */
      __IOM uint32_t LSEBYP     : 1;            /*!< [2..2] LSE oscillator bypass                                              */
      __IOM uint32_t LSEDRV     : 2;            /*!< [4..3] LSE oscillator driving capability                                  */
      __IOM uint32_t LSECSSON   : 1;            /*!< [5..5] LSE clock security system enable                                   */
      __IOM uint32_t LSECSSD    : 1;            /*!< [6..6] LSE clock security system failure detection                        */
            uint32_t            : 1;
      __IOM uint32_t RTCSRC     : 2;            /*!< [9..8] RTC clock source selection                                         */
            uint32_t            : 5;
      __IOM uint32_t RTCEN      : 1;            /*!< [15..15] RTC clock enable                                                 */
      __IOM uint32_t VSWRST     : 1;            /*!< [16..16] VSwitch domain software reset                                    */
            uint32_t            : 15;
    } bit;
  } BDCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000074) RCC Clock Control and Status Register                      */
    
    struct {
      __IOM uint32_t LSION      : 1;            /*!< [0..0] LSI oscillator enable                                              */
      __IOM uint32_t LSIRDY     : 1;            /*!< [1..1] LSI oscillator ready                                               */
            uint32_t            : 30;
    } bit;
  } CSR;
  __IM  uint32_t  RESERVED6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000007C) RCC AHB3 Reset Register                                    */
    
    struct {
      __IOM uint32_t MDMARST    : 1;            /*!< [0..0] MDMA block reset                                                   */
            uint32_t            : 3;
      __IOM uint32_t DMA2DRST   : 1;            /*!< [4..4] DMA2D block reset                                                  */
      __IOM uint32_t JPGDECRST  : 1;            /*!< [5..5] JPGDEC block reset                                                 */
            uint32_t            : 6;
      __IOM uint32_t FMCRST     : 1;            /*!< [12..12] FMC block reset                                                  */
            uint32_t            : 1;
      __IOM uint32_t QSPIRST    : 1;            /*!< [14..14] QUADSPI and QUADSPI delay block reset                            */
            uint32_t            : 1;
      __IOM uint32_t SDMMC1RST  : 1;            /*!< [16..16] SDMMC1 and SDMMC1 delay block reset                              */
            uint32_t            : 14;
      __IOM uint32_t CPURST     : 1;            /*!< [31..31] CPU reset                                                        */
    } bit;
  } AHB3RSTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) RCC AHB1 Peripheral Reset Register                         */
    
    struct {
      __IOM uint32_t DMA1RST    : 1;            /*!< [0..0] DMA1 block reset                                                   */
      __IOM uint32_t DMA2RST    : 1;            /*!< [1..1] DMA2 block reset                                                   */
            uint32_t            : 3;
      __IOM uint32_t ADC12RST   : 1;            /*!< [5..5] ADC1&2 block reset                                                 */
            uint32_t            : 9;
      __IOM uint32_t ETH1MACRST : 1;            /*!< [15..15] ETH1MAC block reset                                              */
            uint32_t            : 9;
      __IOM uint32_t USB1OTGRST : 1;            /*!< [25..25] USB1OTG block reset                                              */
            uint32_t            : 1;
      __IOM uint32_t USB2OTGRST : 1;            /*!< [27..27] USB2OTG block reset                                              */
            uint32_t            : 4;
    } bit;
  } AHB1RSTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000084) RCC AHB2 Peripheral Reset Register                         */
    
    struct {
      __IOM uint32_t CAMITFRST  : 1;            /*!< [0..0] CAMITF block reset                                                 */
            uint32_t            : 3;
      __IOM uint32_t CRYPTRST   : 1;            /*!< [4..4] Cryptography block reset                                           */
      __IOM uint32_t HASHRST    : 1;            /*!< [5..5] Hash block reset                                                   */
      __IOM uint32_t RNGRST     : 1;            /*!< [6..6] Random Number Generator block reset                                */
            uint32_t            : 2;
      __IOM uint32_t SDMMC2RST  : 1;            /*!< [9..9] SDMMC2 and SDMMC2 Delay block reset                                */
            uint32_t            : 22;
    } bit;
  } AHB2RSTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) RCC AHB4 Peripheral Reset Register                         */
    
    struct {
      __IOM uint32_t GPIOARST   : 1;            /*!< [0..0] GPIO block reset                                                   */
      __IOM uint32_t GPIOBRST   : 1;            /*!< [1..1] GPIO block reset                                                   */
      __IOM uint32_t GPIOCRST   : 1;            /*!< [2..2] GPIO block reset                                                   */
      __IOM uint32_t GPIODRST   : 1;            /*!< [3..3] GPIO block reset                                                   */
      __IOM uint32_t GPIOERST   : 1;            /*!< [4..4] GPIO block reset                                                   */
      __IOM uint32_t GPIOFRST   : 1;            /*!< [5..5] GPIO block reset                                                   */
      __IOM uint32_t GPIOGRST   : 1;            /*!< [6..6] GPIO block reset                                                   */
      __IOM uint32_t GPIOHRST   : 1;            /*!< [7..7] GPIO block reset                                                   */
      __IOM uint32_t GPIOIRST   : 1;            /*!< [8..8] GPIO block reset                                                   */
      __IOM uint32_t GPIOJRST   : 1;            /*!< [9..9] GPIO block reset                                                   */
      __IOM uint32_t GPIOKRST   : 1;            /*!< [10..10] GPIO block reset                                                 */
            uint32_t            : 8;
      __IOM uint32_t CRCRST     : 1;            /*!< [19..19] CRC block reset                                                  */
            uint32_t            : 1;
      __IOM uint32_t BDMARST    : 1;            /*!< [21..21] BDMA block reset                                                 */
            uint32_t            : 2;
      __IOM uint32_t ADC3RST    : 1;            /*!< [24..24] ADC3 block reset                                                 */
      __IOM uint32_t HSEMRST    : 1;            /*!< [25..25] HSEM block reset                                                 */
            uint32_t            : 6;
    } bit;
  } AHB4RSTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000008C) RCC APB3 Peripheral Reset Register                         */
    
