ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h
    struct {
            uint32_t            : 3;
      __IOM uint32_t LTDCRST    : 1;            /*!< [3..3] LTDC block reset                                                   */
            uint32_t            : 28;
    } bit;
  } APB3RSTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) RCC APB1 Peripheral Reset Register                         */
    
    struct {
      __IOM uint32_t TIM2RST    : 1;            /*!< [0..0] TIM block reset                                                    */
      __IOM uint32_t TIM3RST    : 1;            /*!< [1..1] TIM block reset                                                    */
      __IOM uint32_t TIM4RST    : 1;            /*!< [2..2] TIM block reset                                                    */
      __IOM uint32_t TIM5RST    : 1;            /*!< [3..3] TIM block reset                                                    */
      __IOM uint32_t TIM6RST    : 1;            /*!< [4..4] TIM block reset                                                    */
      __IOM uint32_t TIM7RST    : 1;            /*!< [5..5] TIM block reset                                                    */
      __IOM uint32_t TIM12RST   : 1;            /*!< [6..6] TIM block reset                                                    */
      __IOM uint32_t TIM13RST   : 1;            /*!< [7..7] TIM block reset                                                    */
      __IOM uint32_t TIM14RST   : 1;            /*!< [8..8] TIM block reset                                                    */
      __IOM uint32_t LPTIM1RST  : 1;            /*!< [9..9] TIM block reset                                                    */
            uint32_t            : 4;
      __IOM uint32_t SPI2RST    : 1;            /*!< [14..14] SPI2 block reset                                                 */
      __IOM uint32_t SPI3RST    : 1;            /*!< [15..15] SPI3 block reset                                                 */
      __IOM uint32_t SPDIFRXRST : 1;            /*!< [16..16] SPDIFRX block reset                                              */
      __IOM uint32_t USART2RST  : 1;            /*!< [17..17] USART2 block reset                                               */
      __IOM uint32_t USART3RST  : 1;            /*!< [18..18] USART3 block reset                                               */
      __IOM uint32_t UART4RST   : 1;            /*!< [19..19] UART4 block reset                                                */
      __IOM uint32_t UART5RST   : 1;            /*!< [20..20] UART5 block reset                                                */
      __IOM uint32_t I2C1RST    : 1;            /*!< [21..21] I2C1 block reset                                                 */
      __IOM uint32_t I2C2RST    : 1;            /*!< [22..22] I2C2 block reset                                                 */
      __IOM uint32_t I2C3RST    : 1;            /*!< [23..23] I2C3 block reset                                                 */
            uint32_t            : 3;
      __IOM uint32_t HDMICECRST : 1;            /*!< [27..27] HDMI-CEC block reset                                             */
            uint32_t            : 1;
      __IOM uint32_t DAC12RST   : 1;            /*!< [29..29] DAC1 and 2 Blocks Reset                                          */
      __IOM uint32_t USART7RST  : 1;            /*!< [30..30] USART7 block reset                                               */
      __IOM uint32_t USART8RST  : 1;            /*!< [31..31] USART8 block reset                                               */
    } bit;
  } APB1LRSTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000094) RCC APB1 Peripheral Reset Register                         */
    
    struct {
            uint32_t            : 1;
      __IOM uint32_t CRSRST     : 1;            /*!< [1..1] Clock Recovery System reset                                        */
      __IOM uint32_t SWPRST     : 1;            /*!< [2..2] SWPMI block reset                                                  */
            uint32_t            : 1;
      __IOM uint32_t OPAMPRST   : 1;            /*!< [4..4] OPAMP block reset                                                  */
      __IOM uint32_t MDIOSRST   : 1;            /*!< [5..5] MDIOS block reset                                                  */
            uint32_t            : 2;
      __IOM uint32_t FDCANRST   : 1;            /*!< [8..8] FDCAN block reset                                                  */
            uint32_t            : 23;
    } bit;
  } APB1HRSTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000098) RCC APB2 Peripheral Reset Register                         */
    
    struct {
      __IOM uint32_t TIM1RST    : 1;            /*!< [0..0] TIM1 block reset                                                   */
      __IOM uint32_t TIM8RST    : 1;            /*!< [1..1] TIM8 block reset                                                   */
            uint32_t            : 2;
      __IOM uint32_t USART1RST  : 1;            /*!< [4..4] USART1 block reset                                                 */
      __IOM uint32_t USART6RST  : 1;            /*!< [5..5] USART6 block reset                                                 */
            uint32_t            : 6;
      __IOM uint32_t SPI1RST    : 1;            /*!< [12..12] SPI1 block reset                                                 */
      __IOM uint32_t SPI4RST    : 1;            /*!< [13..13] SPI4 block reset                                                 */
            uint32_t            : 2;
      __IOM uint32_t TIM15RST   : 1;            /*!< [16..16] TIM15 block reset                                                */
      __IOM uint32_t TIM16RST   : 1;            /*!< [17..17] TIM16 block reset                                                */
      __IOM uint32_t TIM17RST   : 1;            /*!< [18..18] TIM17 block reset                                                */
            uint32_t            : 1;
      __IOM uint32_t SPI5RST    : 1;            /*!< [20..20] SPI5 block reset                                                 */
            uint32_t            : 1;
      __IOM uint32_t SAI1RST    : 1;            /*!< [22..22] SAI1 block reset                                                 */
      __IOM uint32_t SAI2RST    : 1;            /*!< [23..23] SAI2 block reset                                                 */
      __IOM uint32_t SAI3RST    : 1;            /*!< [24..24] SAI3 block reset                                                 */
            uint32_t            : 3;
      __IOM uint32_t DFSDM1RST  : 1;            /*!< [28..28] DFSDM1 block reset                                               */
      __IOM uint32_t HRTIMRST   : 1;            /*!< [29..29] HRTIM block reset                                                */
            uint32_t            : 2;
    } bit;
  } APB2RSTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000009C) RCC APB4 Peripheral Reset Register                         */
    
