ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h
    struct {
            uint32_t            : 1;
      __IOM uint32_t SYSCFGRST  : 1;            /*!< [1..1] SYSCFG block reset                                                 */
            uint32_t            : 1;
      __IOM uint32_t LPUART1RST : 1;            /*!< [3..3] LPUART1 block reset                                                */
            uint32_t            : 1;
      __IOM uint32_t SPI6RST    : 1;            /*!< [5..5] SPI6 block reset                                                   */
            uint32_t            : 1;
      __IOM uint32_t I2C4RST    : 1;            /*!< [7..7] I2C4 block reset                                                   */
            uint32_t            : 1;
      __IOM uint32_t LPTIM2RST  : 1;            /*!< [9..9] LPTIM2 block reset                                                 */
      __IOM uint32_t LPTIM3RST  : 1;            /*!< [10..10] LPTIM3 block reset                                               */
      __IOM uint32_t LPTIM4RST  : 1;            /*!< [11..11] LPTIM4 block reset                                               */
      __IOM uint32_t LPTIM5RST  : 1;            /*!< [12..12] LPTIM5 block reset                                               */
            uint32_t            : 1;
      __IOM uint32_t COMP12RST  : 1;            /*!< [14..14] COMP12 Blocks Reset                                              */
      __IOM uint32_t VREFRST    : 1;            /*!< [15..15] VREF block reset                                                 */
            uint32_t            : 5;
      __IOM uint32_t SAI4RST    : 1;            /*!< [21..21] SAI4 block reset                                                 */
            uint32_t            : 10;
    } bit;
  } APB4RSTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) RCC Global Control Register                                */
    
    struct {
      __IOM uint32_t WW1RSC     : 1;            /*!< [0..0] WWDG1 reset scope control                                          */
            uint32_t            : 31;
    } bit;
  } GCR;
  __IM  uint32_t  RESERVED7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) RCC D3 Autonomous mode Register                            */
    
    struct {
      __IOM uint32_t BDMAAMEN   : 1;            /*!< [0..0] BDMA and DMAMUX Autonomous mode enable                             */
            uint32_t            : 2;
      __IOM uint32_t LPUART1AMEN : 1;           /*!< [3..3] LPUART1 Autonomous mode enable                                     */
            uint32_t            : 1;
      __IOM uint32_t SPI6AMEN   : 1;            /*!< [5..5] SPI6 Autonomous mode enable                                        */
            uint32_t            : 1;
      __IOM uint32_t I2C4AMEN   : 1;            /*!< [7..7] I2C4 Autonomous mode enable                                        */
            uint32_t            : 1;
      __IOM uint32_t LPTIM2AMEN : 1;            /*!< [9..9] LPTIM2 Autonomous mode enable                                      */
      __IOM uint32_t LPTIM3AMEN : 1;            /*!< [10..10] LPTIM3 Autonomous mode enable                                    */
      __IOM uint32_t LPTIM4AMEN : 1;            /*!< [11..11] LPTIM4 Autonomous mode enable                                    */
      __IOM uint32_t LPTIM5AMEN : 1;            /*!< [12..12] LPTIM5 Autonomous mode enable                                    */
            uint32_t            : 1;
      __IOM uint32_t COMP12AMEN : 1;            /*!< [14..14] COMP12 Autonomous mode enable                                    */
      __IOM uint32_t VREFAMEN   : 1;            /*!< [15..15] VREF Autonomous mode enable                                      */
      __IOM uint32_t RTCAMEN    : 1;            /*!< [16..16] RTC Autonomous mode enable                                       */
            uint32_t            : 2;
      __IOM uint32_t CRCAMEN    : 1;            /*!< [19..19] CRC Autonomous mode enable                                       */
            uint32_t            : 1;
      __IOM uint32_t SAI4AMEN   : 1;            /*!< [21..21] SAI4 Autonomous mode enable                                      */
            uint32_t            : 2;
      __IOM uint32_t ADC3AMEN   : 1;            /*!< [24..24] ADC3 Autonomous mode enable                                      */
            uint32_t            : 3;
      __IOM uint32_t BKPSRAMAMEN : 1;           /*!< [28..28] Backup RAM Autonomous mode enable                                */
      __IOM uint32_t SRAM4AMEN  : 1;            /*!< [29..29] SRAM4 Autonomous mode enable                                     */
            uint32_t            : 2;
    } bit;
  } D3AMR;
  __IM  uint32_t  RESERVED8[9];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D0) RCC Reset Status Register                                  */
    
    struct {
            uint32_t            : 16;
      __IOM uint32_t RMVF       : 1;            /*!< [16..16] Remove reset flag                                                */
      __IOM uint32_t CPURSTF    : 1;            /*!< [17..17] CPU reset flag                                                   */
            uint32_t            : 1;
      __IOM uint32_t D1RSTF     : 1;            /*!< [19..19] D1 domain power switch reset flag                                */
      __IOM uint32_t D2RSTF     : 1;            /*!< [20..20] D2 domain power switch reset flag                                */
      __IOM uint32_t BORRSTF    : 1;            /*!< [21..21] BOR reset flag                                                   */
      __IOM uint32_t PINRSTF    : 1;            /*!< [22..22] Pin reset flag (NRST)                                            */
      __IOM uint32_t PORRSTF    : 1;            /*!< [23..23] POR/PDR reset flag                                               */
      __IOM uint32_t SFTRSTF    : 1;            /*!< [24..24] System reset from CPU reset flag                                 */
            uint32_t            : 1;
      __IOM uint32_t IWDG1RSTF  : 1;            /*!< [26..26] Independent Watchdog reset flag                                  */
            uint32_t            : 1;
      __IOM uint32_t WWDG1RSTF  : 1;            /*!< [28..28] Window Watchdog reset flag                                       */
            uint32_t            : 1;
      __IOM uint32_t LPWRRSTF   : 1;            /*!< [30..30] Reset due to illegal D1 DStandby or CPU CStop flag               */
            uint32_t            : 1;
    } bit;
  } RSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D4) RCC AHB3 Clock Register                                    */
    
