ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h
    struct {
      __IOM uint32_t MDMAEN     : 1;            /*!< [0..0] MDMA Peripheral Clock Enable                                       */
            uint32_t            : 3;
      __IOM uint32_t DMA2DEN    : 1;            /*!< [4..4] DMA2D Peripheral Clock Enable                                      */
      __IOM uint32_t JPGDECEN   : 1;            /*!< [5..5] JPGDEC Peripheral Clock Enable                                     */
            uint32_t            : 6;
      __IOM uint32_t FMCEN      : 1;            /*!< [12..12] FMC Peripheral Clocks Enable                                     */
            uint32_t            : 1;
      __IOM uint32_t QSPIEN     : 1;            /*!< [14..14] QUADSPI and QUADSPI Delay Clock Enable                           */
            uint32_t            : 1;
      __IOM uint32_t SDMMC1EN   : 1;            /*!< [16..16] SDMMC1 and SDMMC1 Delay Clock Enable                             */
            uint32_t            : 15;
    } bit;
  } AHB3ENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D8) RCC AHB1 Clock Register                                    */
    
    struct {
      __IOM uint32_t DMA1EN     : 1;            /*!< [0..0] DMA1 Clock Enable                                                  */
      __IOM uint32_t DMA2EN     : 1;            /*!< [1..1] DMA2 Clock Enable                                                  */
            uint32_t            : 3;
      __IOM uint32_t ADC12EN    : 1;            /*!< [5..5] ADC1/2 Peripheral Clocks Enable                                    */
            uint32_t            : 9;
      __IOM uint32_t ETH1MACEN  : 1;            /*!< [15..15] Ethernet MAC bus interface Clock Enable                          */
      __IOM uint32_t ETH1TXEN   : 1;            /*!< [16..16] Ethernet Transmission Clock Enable                               */
      __IOM uint32_t ETH1RXEN   : 1;            /*!< [17..17] Ethernet Reception Clock Enable                                  */
            uint32_t            : 7;
      __IOM uint32_t USB1OTGEN  : 1;            /*!< [25..25] USB1OTG Peripheral Clocks Enable                                 */
      __IOM uint32_t USB1ULPIEN : 1;            /*!< [26..26] USB_PHY1 Clocks Enable                                           */
      __IOM uint32_t USB2OTGEN  : 1;            /*!< [27..27] USB2OTG Peripheral Clocks Enable                                 */
      __IOM uint32_t USB2ULPIEN : 1;            /*!< [28..28] USB_PHY2 Clocks Enable                                           */
            uint32_t            : 3;
    } bit;
  } AHB1ENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000DC) RCC AHB2 Clock Register                                    */
    
    struct {
      __IOM uint32_t CAMITFEN   : 1;            /*!< [0..0] CAMITF peripheral clock enable                                     */
            uint32_t            : 3;
      __IOM uint32_t CRYPTEN    : 1;            /*!< [4..4] CRYPT peripheral clock enable                                      */
      __IOM uint32_t HASHEN     : 1;            /*!< [5..5] HASH peripheral clock enable                                       */
      __IOM uint32_t RNGEN      : 1;            /*!< [6..6] RNG peripheral clocks enable                                       */
            uint32_t            : 2;
      __IOM uint32_t SDMMC2EN   : 1;            /*!< [9..9] SDMMC2 and SDMMC2 delay clock enable                               */
            uint32_t            : 19;
      __IOM uint32_t SRAM1EN    : 1;            /*!< [29..29] SRAM1 block enable                                               */
      __IOM uint32_t SRAM2EN    : 1;            /*!< [30..30] SRAM2 block enable                                               */
      __IOM uint32_t SRAM3EN    : 1;            /*!< [31..31] SRAM3 block enable                                               */
    } bit;
  } AHB2ENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E0) RCC AHB4 Clock Register                                    */
    
    struct {
      __IOM uint32_t GPIOAEN    : 1;            /*!< [0..0] 0GPIO peripheral clock enable                                      */
      __IOM uint32_t GPIOBEN    : 1;            /*!< [1..1] 0GPIO peripheral clock enable                                      */
      __IOM uint32_t GPIOCEN    : 1;            /*!< [2..2] 0GPIO peripheral clock enable                                      */
      __IOM uint32_t GPIODEN    : 1;            /*!< [3..3] 0GPIO peripheral clock enable                                      */
      __IOM uint32_t GPIOEEN    : 1;            /*!< [4..4] 0GPIO peripheral clock enable                                      */
      __IOM uint32_t GPIOFEN    : 1;            /*!< [5..5] 0GPIO peripheral clock enable                                      */
      __IOM uint32_t GPIOGEN    : 1;            /*!< [6..6] 0GPIO peripheral clock enable                                      */
      __IOM uint32_t GPIOHEN    : 1;            /*!< [7..7] 0GPIO peripheral clock enable                                      */
      __IOM uint32_t GPIOIEN    : 1;            /*!< [8..8] 0GPIO peripheral clock enable                                      */
      __IOM uint32_t GPIOJEN    : 1;            /*!< [9..9] 0GPIO peripheral clock enable                                      */
      __IOM uint32_t GPIOKEN    : 1;            /*!< [10..10] 0GPIO peripheral clock enable                                    */
            uint32_t            : 8;
      __IOM uint32_t CRCEN      : 1;            /*!< [19..19] CRC peripheral clock enable                                      */
            uint32_t            : 1;
      __IOM uint32_t BDMAEN     : 1;            /*!< [21..21] BDMA and DMAMUX2 Clock Enable                                    */
            uint32_t            : 2;
      __IOM uint32_t ADC3EN     : 1;            /*!< [24..24] ADC3 Peripheral Clocks Enable                                    */
      __IOM uint32_t HSEMEN     : 1;            /*!< [25..25] HSEM peripheral clock enable                                     */
            uint32_t            : 2;
      __IOM uint32_t BKPRAMEN   : 1;            /*!< [28..28] Backup RAM Clock Enable                                          */
            uint32_t            : 3;
    } bit;
  } AHB4ENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E4) RCC APB3 Clock Register                                    */
    
