ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h
    struct {
            uint32_t            : 3;
      __IOM uint32_t LTDCEN     : 1;            /*!< [3..3] LTDC peripheral clock enable                                       */
            uint32_t            : 2;
      __IOM uint32_t WWDG1EN    : 1;            /*!< [6..6] WWDG1 Clock Enable                                                 */
            uint32_t            : 25;
    } bit;
  } APB3ENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E8) RCC APB1 Clock Register                                    */
    
    struct {
      __IOM uint32_t TIM2EN     : 1;            /*!< [0..0] TIM peripheral clock enable                                        */
      __IOM uint32_t TIM3EN     : 1;            /*!< [1..1] TIM peripheral clock enable                                        */
      __IOM uint32_t TIM4EN     : 1;            /*!< [2..2] TIM peripheral clock enable                                        */
      __IOM uint32_t TIM5EN     : 1;            /*!< [3..3] TIM peripheral clock enable                                        */
      __IOM uint32_t TIM6EN     : 1;            /*!< [4..4] TIM peripheral clock enable                                        */
      __IOM uint32_t TIM7EN     : 1;            /*!< [5..5] TIM peripheral clock enable                                        */
      __IOM uint32_t TIM12EN    : 1;            /*!< [6..6] TIM peripheral clock enable                                        */
      __IOM uint32_t TIM13EN    : 1;            /*!< [7..7] TIM peripheral clock enable                                        */
      __IOM uint32_t TIM14EN    : 1;            /*!< [8..8] TIM peripheral clock enable                                        */
      __IOM uint32_t LPTIM1EN   : 1;            /*!< [9..9] LPTIM1 Peripheral Clocks Enable                                    */
            uint32_t            : 4;
      __IOM uint32_t SPI2EN     : 1;            /*!< [14..14] SPI2 Peripheral Clocks Enable                                    */
      __IOM uint32_t SPI3EN     : 1;            /*!< [15..15] SPI3 Peripheral Clocks Enable                                    */
      __IOM uint32_t SPDIFRXEN  : 1;            /*!< [16..16] SPDIFRX Peripheral Clocks Enable                                 */
      __IOM uint32_t USART2EN   : 1;            /*!< [17..17] USART2 Peripheral Clocks Enable                                  */
      __IOM uint32_t USART3EN   : 1;            /*!< [18..18] USART3 Peripheral Clocks Enable                                  */
      __IOM uint32_t UART4EN    : 1;            /*!< [19..19] UART4 Peripheral Clocks Enable                                   */
      __IOM uint32_t UART5EN    : 1;            /*!< [20..20] UART5 Peripheral Clocks Enable                                   */
      __IOM uint32_t I2C1EN     : 1;            /*!< [21..21] I2C1 Peripheral Clocks Enable                                    */
      __IOM uint32_t I2C2EN     : 1;            /*!< [22..22] I2C2 Peripheral Clocks Enable                                    */
      __IOM uint32_t I2C3EN     : 1;            /*!< [23..23] I2C3 Peripheral Clocks Enable                                    */
            uint32_t            : 3;
      __IOM uint32_t HDMICECEN  : 1;            /*!< [27..27] HDMI-CEC peripheral clock enable                                 */
            uint32_t            : 1;
      __IOM uint32_t DAC12EN    : 1;            /*!< [29..29] DAC1&2 peripheral clock enable                                   */
      __IOM uint32_t USART7EN   : 1;            /*!< [30..30] USART7 Peripheral Clocks Enable                                  */
      __IOM uint32_t USART8EN   : 1;            /*!< [31..31] USART8 Peripheral Clocks Enable                                  */
    } bit;
  } APB1LENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000EC) RCC APB1 Clock Register                                    */
    
    struct {
            uint32_t            : 1;
      __IOM uint32_t CRSEN      : 1;            /*!< [1..1] Clock Recovery System peripheral clock enable                      */
      __IOM uint32_t SWPEN      : 1;            /*!< [2..2] SWPMI Peripheral Clocks Enable                                     */
            uint32_t            : 1;
      __IOM uint32_t OPAMPEN    : 1;            /*!< [4..4] OPAMP peripheral clock enable                                      */
      __IOM uint32_t MDIOSEN    : 1;            /*!< [5..5] MDIOS peripheral clock enable                                      */
            uint32_t            : 2;
      __IOM uint32_t FDCANEN    : 1;            /*!< [8..8] FDCAN Peripheral Clocks Enable                                     */
            uint32_t            : 23;
    } bit;
  } APB1HENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F0) RCC APB2 Clock Register                                    */
    
    struct {
      __IOM uint32_t TIM1EN     : 1;            /*!< [0..0] TIM1 peripheral clock enable                                       */
      __IOM uint32_t TIM8EN     : 1;            /*!< [1..1] TIM8 peripheral clock enable                                       */
            uint32_t            : 2;
      __IOM uint32_t USART1EN   : 1;            /*!< [4..4] USART1 Peripheral Clocks Enable                                    */
      __IOM uint32_t USART6EN   : 1;            /*!< [5..5] USART6 Peripheral Clocks Enable                                    */
            uint32_t            : 6;
      __IOM uint32_t SPI1EN     : 1;            /*!< [12..12] SPI1 Peripheral Clocks Enable                                    */
      __IOM uint32_t SPI4EN     : 1;            /*!< [13..13] SPI4 Peripheral Clocks Enable                                    */
            uint32_t            : 2;
      __IOM uint32_t TIM15EN    : 1;            /*!< [16..16] TIM15 peripheral clock enable                                    */
      __IOM uint32_t TIM16EN    : 1;            /*!< [17..17] TIM16 peripheral clock enable                                    */
      __IOM uint32_t TIM17EN    : 1;            /*!< [18..18] TIM17 peripheral clock enable                                    */
            uint32_t            : 1;
      __IOM uint32_t SPI5EN     : 1;            /*!< [20..20] SPI5 Peripheral Clocks Enable                                    */
            uint32_t            : 1;
      __IOM uint32_t SAI1EN     : 1;            /*!< [22..22] SAI1 Peripheral Clocks Enable                                    */
      __IOM uint32_t SAI2EN     : 1;            /*!< [23..23] SAI2 Peripheral Clocks Enable                                    */
      __IOM uint32_t SAI3EN     : 1;            /*!< [24..24] SAI3 Peripheral Clocks Enable                                    */
            uint32_t            : 3;
      __IOM uint32_t DFSDM1EN   : 1;            /*!< [28..28] DFSDM1 Peripheral Clocks Enable                                  */
      __IOM uint32_t HRTIMEN    : 1;            /*!< [29..29] HRTIM peripheral clock enable                                    */
            uint32_t            : 2;
    } bit;
  } APB2ENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F4) RCC APB4 Clock Register                                    */
    
