ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h
    struct {
            uint32_t            : 1;
      __IOM uint32_t SYSCFGEN   : 1;            /*!< [1..1] SYSCFG peripheral clock enable                                     */
            uint32_t            : 1;
      __IOM uint32_t LPUART1EN  : 1;            /*!< [3..3] LPUART1 Peripheral Clocks Enable                                   */
            uint32_t            : 1;
      __IOM uint32_t SPI6EN     : 1;            /*!< [5..5] SPI6 Peripheral Clocks Enable                                      */
            uint32_t            : 1;
      __IOM uint32_t I2C4EN     : 1;            /*!< [7..7] I2C4 Peripheral Clocks Enable                                      */
            uint32_t            : 1;
      __IOM uint32_t LPTIM2EN   : 1;            /*!< [9..9] LPTIM2 Peripheral Clocks Enable                                    */
      __IOM uint32_t LPTIM3EN   : 1;            /*!< [10..10] LPTIM3 Peripheral Clocks Enable                                  */
      __IOM uint32_t LPTIM4EN   : 1;            /*!< [11..11] LPTIM4 Peripheral Clocks Enable                                  */
      __IOM uint32_t LPTIM5EN   : 1;            /*!< [12..12] LPTIM5 Peripheral Clocks Enable                                  */
            uint32_t            : 1;
      __IOM uint32_t COMP12EN   : 1;            /*!< [14..14] COMP1/2 peripheral clock enable                                  */
      __IOM uint32_t VREFEN     : 1;            /*!< [15..15] VREF peripheral clock enable                                     */
      __IOM uint32_t RTCAPBEN   : 1;            /*!< [16..16] RTC APB Clock Enable                                             */
            uint32_t            : 4;
      __IOM uint32_t SAI4EN     : 1;            /*!< [21..21] SAI4 Peripheral Clocks Enable                                    */
            uint32_t            : 10;
    } bit;
  } APB4ENR;
  __IM  uint32_t  RESERVED9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000FC) RCC AHB3 Sleep Clock Register                              */
    
    struct {
      __IOM uint32_t MDMALPEN   : 1;            /*!< [0..0] MDMA Clock Enable During CSleep Mode                               */
            uint32_t            : 3;
      __IOM uint32_t DMA2DLPEN  : 1;            /*!< [4..4] DMA2D Clock Enable During CSleep Mode                              */
      __IOM uint32_t JPGDECLPEN : 1;            /*!< [5..5] JPGDEC Clock Enable During CSleep Mode                             */
            uint32_t            : 2;
      __IOM uint32_t FLITFLPEN  : 1;            /*!< [8..8] FLITF Clock Enable During CSleep Mode                              */
            uint32_t            : 3;
      __IOM uint32_t FMCLPEN    : 1;            /*!< [12..12] FMC Peripheral Clocks Enable During CSleep Mode                  */
            uint32_t            : 1;
      __IOM uint32_t QSPILPEN   : 1;            /*!< [14..14] QUADSPI and QUADSPI Delay Clock Enable During CSleep
                                                     Mode                                                                      */
            uint32_t            : 1;
      __IOM uint32_t SDMMC1LPEN : 1;            /*!< [16..16] SDMMC1 and SDMMC1 Delay Clock Enable During CSleep
                                                     Mode                                                                      */
            uint32_t            : 11;
      __IOM uint32_t D1DTCM1LPEN : 1;           /*!< [28..28] D1DTCM1 Block Clock Enable During CSleep mode                    */
      __IOM uint32_t DTCM2LPEN  : 1;            /*!< [29..29] D1 DTCM2 Block Clock Enable During CSleep mode                   */
      __IOM uint32_t ITCMLPEN   : 1;            /*!< [30..30] D1ITCM Block Clock Enable During CSleep mode                     */
      __IOM uint32_t AXISRAMLPEN : 1;           /*!< [31..31] AXISRAM Block Clock Enable During CSleep mode                    */
    } bit;
  } AHB3LPENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000100) RCC AHB1 Sleep Clock Register                              */
    
    struct {
      __IOM uint32_t DMA1LPEN   : 1;            /*!< [0..0] DMA1 Clock Enable During CSleep Mode                               */
      __IOM uint32_t DMA2LPEN   : 1;            /*!< [1..1] DMA2 Clock Enable During CSleep Mode                               */
            uint32_t            : 3;
      __IOM uint32_t ADC12LPEN  : 1;            /*!< [5..5] ADC1/2 Peripheral Clocks Enable During CSleep Mode                 */
            uint32_t            : 9;
      __IOM uint32_t ETH1MACLPEN : 1;           /*!< [15..15] Ethernet MAC bus interface Clock Enable During CSleep
                                                     Mode                                                                      */
      __IOM uint32_t ETH1TXLPEN : 1;            /*!< [16..16] Ethernet Transmission Clock Enable During CSleep Mode            */
      __IOM uint32_t ETH1RXLPEN : 1;            /*!< [17..17] Ethernet Reception Clock Enable During CSleep Mode               */
            uint32_t            : 7;
      __IOM uint32_t USB1OTGLPEN : 1;           /*!< [25..25] USB1OTG peripheral clock enable during CSleep mode               */
      __IOM uint32_t USB1ULPILPEN : 1;          /*!< [26..26] USB_PHY1 clock enable during CSleep mode                         */
      __IOM uint32_t USB2OTGLPEN : 1;           /*!< [27..27] USB2OTG peripheral clock enable during CSleep mode               */
      __IOM uint32_t USB2ULPILPEN : 1;          /*!< [28..28] USB_PHY2 clocks enable during CSleep mode                        */
            uint32_t            : 3;
    } bit;
  } AHB1LPENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000104) RCC AHB2 Sleep Clock Register                              */
    
    struct {
      __IOM uint32_t CAMITFLPEN : 1;            /*!< [0..0] CAMITF peripheral clock enable during CSleep mode                  */
            uint32_t            : 3;
      __IOM uint32_t CRYPTLPEN  : 1;            /*!< [4..4] CRYPT peripheral clock enable during CSleep mode                   */
      __IOM uint32_t HASHLPEN   : 1;            /*!< [5..5] HASH peripheral clock enable during CSleep mode                    */
      __IOM uint32_t RNGLPEN    : 1;            /*!< [6..6] RNG peripheral clock enable during CSleep mode                     */
            uint32_t            : 2;
      __IOM uint32_t SDMMC2LPEN : 1;            /*!< [9..9] SDMMC2 and SDMMC2 Delay Clock Enable During CSleep Mode            */
            uint32_t            : 19;
      __IOM uint32_t SRAM1LPEN  : 1;            /*!< [29..29] SRAM1 Clock Enable During CSleep Mode                            */
      __IOM uint32_t SRAM2LPEN  : 1;            /*!< [30..30] SRAM2 Clock Enable During CSleep Mode                            */
      __IOM uint32_t SRAM3LPEN  : 1;            /*!< [31..31] SRAM3 Clock Enable During CSleep Mode                            */
    } bit;
  } AHB2LPENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000108) RCC AHB4 Sleep Clock Register                              */
    
