ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h
    struct {
            uint32_t            : 1;
      __IOM uint32_t CRSLPEN    : 1;            /*!< [1..1] Clock Recovery System peripheral clock enable during
                                                     CSleep mode                                                               */
      __IOM uint32_t SWPLPEN    : 1;            /*!< [2..2] SWPMI Peripheral Clocks Enable During CSleep Mode                  */
            uint32_t            : 1;
      __IOM uint32_t OPAMPLPEN  : 1;            /*!< [4..4] OPAMP peripheral clock enable during CSleep mode                   */
      __IOM uint32_t MDIOSLPEN  : 1;            /*!< [5..5] MDIOS peripheral clock enable during CSleep mode                   */
            uint32_t            : 2;
      __IOM uint32_t FDCANLPEN  : 1;            /*!< [8..8] FDCAN Peripheral Clocks Enable During CSleep Mode                  */
            uint32_t            : 23;
    } bit;
  } APB1HLPENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000118) RCC APB2 Sleep Clock Register                              */
    
    struct {
      __IOM uint32_t TIM1LPEN   : 1;            /*!< [0..0] TIM1 peripheral clock enable during CSleep mode                    */
      __IOM uint32_t TIM8LPEN   : 1;            /*!< [1..1] TIM8 peripheral clock enable during CSleep mode                    */
            uint32_t            : 2;
      __IOM uint32_t USART1LPEN : 1;            /*!< [4..4] USART1 Peripheral Clocks Enable During CSleep Mode                 */
      __IOM uint32_t USART6LPEN : 1;            /*!< [5..5] USART6 Peripheral Clocks Enable During CSleep Mode                 */
            uint32_t            : 6;
      __IOM uint32_t SPI1LPEN   : 1;            /*!< [12..12] SPI1 Peripheral Clocks Enable During CSleep Mode                 */
      __IOM uint32_t SPI4LPEN   : 1;            /*!< [13..13] SPI4 Peripheral Clocks Enable During CSleep Mode                 */
            uint32_t            : 2;
      __IOM uint32_t TIM15LPEN  : 1;            /*!< [16..16] TIM15 peripheral clock enable during CSleep mode                 */
      __IOM uint32_t TIM16LPEN  : 1;            /*!< [17..17] TIM16 peripheral clock enable during CSleep mode                 */
      __IOM uint32_t TIM17LPEN  : 1;            /*!< [18..18] TIM17 peripheral clock enable during CSleep mode                 */
            uint32_t            : 1;
      __IOM uint32_t SPI5LPEN   : 1;            /*!< [20..20] SPI5 Peripheral Clocks Enable During CSleep Mode                 */
            uint32_t            : 1;
      __IOM uint32_t SAI1LPEN   : 1;            /*!< [22..22] SAI1 Peripheral Clocks Enable During CSleep Mode                 */
      __IOM uint32_t SAI2LPEN   : 1;            /*!< [23..23] SAI2 Peripheral Clocks Enable During CSleep Mode                 */
      __IOM uint32_t SAI3LPEN   : 1;            /*!< [24..24] SAI3 Peripheral Clocks Enable During CSleep Mode                 */
            uint32_t            : 3;
      __IOM uint32_t DFSDM1LPEN : 1;            /*!< [28..28] DFSDM1 Peripheral Clocks Enable During CSleep Mode               */
      __IOM uint32_t HRTIMLPEN  : 1;            /*!< [29..29] HRTIM peripheral clock enable during CSleep mode                 */
            uint32_t            : 2;
    } bit;
  } APB2LPENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000011C) RCC APB4 Sleep Clock Register                              */
    
    struct {
            uint32_t            : 1;
      __IOM uint32_t SYSCFGLPEN : 1;            /*!< [1..1] SYSCFG peripheral clock enable during CSleep mode                  */
            uint32_t            : 1;
      __IOM uint32_t LPUART1LPEN : 1;           /*!< [3..3] LPUART1 Peripheral Clocks Enable During CSleep Mode                */
            uint32_t            : 1;
      __IOM uint32_t SPI6LPEN   : 1;            /*!< [5..5] SPI6 Peripheral Clocks Enable During CSleep Mode                   */
            uint32_t            : 1;
      __IOM uint32_t I2C4LPEN   : 1;            /*!< [7..7] I2C4 Peripheral Clocks Enable During CSleep Mode                   */
            uint32_t            : 1;
      __IOM uint32_t LPTIM2LPEN : 1;            /*!< [9..9] LPTIM2 Peripheral Clocks Enable During CSleep Mode                 */
      __IOM uint32_t LPTIM3LPEN : 1;            /*!< [10..10] LPTIM3 Peripheral Clocks Enable During CSleep Mode               */
      __IOM uint32_t LPTIM4LPEN : 1;            /*!< [11..11] LPTIM4 Peripheral Clocks Enable During CSleep Mode               */
      __IOM uint32_t LPTIM5LPEN : 1;            /*!< [12..12] LPTIM5 Peripheral Clocks Enable During CSleep Mode               */
            uint32_t            : 1;
      __IOM uint32_t COMP12LPEN : 1;            /*!< [14..14] COMP1/2 peripheral clock enable during CSleep mode               */
      __IOM uint32_t VREFLPEN   : 1;            /*!< [15..15] VREF peripheral clock enable during CSleep mode                  */
      __IOM uint32_t RTCAPBLPEN : 1;            /*!< [16..16] RTC APB Clock Enable During CSleep Mode                          */
            uint32_t            : 4;
      __IOM uint32_t SAI4LPEN   : 1;            /*!< [21..21] SAI4 Peripheral Clocks Enable During CSleep Mode                 */
            uint32_t            : 10;
    } bit;
  } APB4LPENR;
  __IM  uint32_t  RESERVED10[4];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000130) RCC Reset Status Register                                  */
    
    struct {
            uint32_t            : 16;
      __IOM uint32_t RMVF       : 1;            /*!< [16..16] Remove reset flag                                                */
      __IOM uint32_t CPURSTF    : 1;            /*!< [17..17] CPU reset flag                                                   */
            uint32_t            : 1;
      __IOM uint32_t D1RSTF     : 1;            /*!< [19..19] D1 domain power switch reset flag                                */
      __IOM uint32_t D2RSTF     : 1;            /*!< [20..20] D2 domain power switch reset flag                                */
      __IOM uint32_t BORRSTF    : 1;            /*!< [21..21] BOR reset flag                                                   */
      __IOM uint32_t PINRSTF    : 1;            /*!< [22..22] Pin reset flag (NRST)                                            */
      __IOM uint32_t PORRSTF    : 1;            /*!< [23..23] POR/PDR reset flag                                               */
      __IOM uint32_t SFTRSTF    : 1;            /*!< [24..24] System reset from CPU reset flag                                 */
            uint32_t            : 1;
      __IOM uint32_t IWDG1RSTF  : 1;            /*!< [26..26] Independent Watchdog reset flag                                  */
            uint32_t            : 1;
      __IOM uint32_t WWDG1RSTF  : 1;            /*!< [28..28] Window Watchdog reset flag                                       */
            uint32_t            : 1;
      __IOM uint32_t LPWRRSTF   : 1;            /*!< [30..30] Reset due to illegal D1 DStandby or CPU CStop flag               */
            uint32_t            : 1;
    } bit;
  } C1_RSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000134) RCC AHB3 Clock Register                                    */
    
