ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h
    struct {
      __IOM uint32_t GPIOALPEN  : 1;            /*!< [0..0] GPIO peripheral clock enable during CSleep mode                    */
      __IOM uint32_t GPIOBLPEN  : 1;            /*!< [1..1] GPIO peripheral clock enable during CSleep mode                    */
      __IOM uint32_t GPIOCLPEN  : 1;            /*!< [2..2] GPIO peripheral clock enable during CSleep mode                    */
      __IOM uint32_t GPIODLPEN  : 1;            /*!< [3..3] GPIO peripheral clock enable during CSleep mode                    */
      __IOM uint32_t GPIOELPEN  : 1;            /*!< [4..4] GPIO peripheral clock enable during CSleep mode                    */
      __IOM uint32_t GPIOFLPEN  : 1;            /*!< [5..5] GPIO peripheral clock enable during CSleep mode                    */
      __IOM uint32_t GPIOGLPEN  : 1;            /*!< [6..6] GPIO peripheral clock enable during CSleep mode                    */
      __IOM uint32_t GPIOHLPEN  : 1;            /*!< [7..7] GPIO peripheral clock enable during CSleep mode                    */
      __IOM uint32_t GPIOILPEN  : 1;            /*!< [8..8] GPIO peripheral clock enable during CSleep mode                    */
      __IOM uint32_t GPIOJLPEN  : 1;            /*!< [9..9] GPIO peripheral clock enable during CSleep mode                    */
      __IOM uint32_t GPIOKLPEN  : 1;            /*!< [10..10] GPIO peripheral clock enable during CSleep mode                  */
            uint32_t            : 8;
      __IOM uint32_t CRCLPEN    : 1;            /*!< [19..19] CRC peripheral clock enable during CSleep mode                   */
            uint32_t            : 1;
      __IOM uint32_t BDMALPEN   : 1;            /*!< [21..21] BDMA Clock Enable During CSleep Mode                             */
            uint32_t            : 2;
      __IOM uint32_t ADC3LPEN   : 1;            /*!< [24..24] ADC3 Peripheral Clocks Enable During CSleep Mode                 */
            uint32_t            : 3;
      __IOM uint32_t BKPRAMLPEN : 1;            /*!< [28..28] Backup RAM Clock Enable During CSleep Mode                       */
      __IOM uint32_t SRAM4LPEN  : 1;            /*!< [29..29] SRAM4 Clock Enable During CSleep Mode                            */
            uint32_t            : 2;
    } bit;
  } C1_AHB4LPENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000016C) RCC APB3 Sleep Clock Register                              */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t LTDCLPEN   : 1;            /*!< [3..3] LTDC peripheral clock enable during CSleep mode                    */
            uint32_t            : 2;
      __IOM uint32_t WWDG1LPEN  : 1;            /*!< [6..6] WWDG1 Clock Enable During CSleep Mode                              */
            uint32_t            : 25;
    } bit;
  } C1_APB3LPENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000170) RCC APB1 Low Sleep Clock Register                          */
    
    struct {
      __IOM uint32_t TIM2LPEN   : 1;            /*!< [0..0] TIM2 peripheral clock enable during CSleep mode                    */
      __IOM uint32_t TIM3LPEN   : 1;            /*!< [1..1] TIM3 peripheral clock enable during CSleep mode                    */
      __IOM uint32_t TIM4LPEN   : 1;            /*!< [2..2] TIM4 peripheral clock enable during CSleep mode                    */
      __IOM uint32_t TIM5LPEN   : 1;            /*!< [3..3] TIM5 peripheral clock enable during CSleep mode                    */
      __IOM uint32_t TIM6LPEN   : 1;            /*!< [4..4] TIM6 peripheral clock enable during CSleep mode                    */
      __IOM uint32_t TIM7LPEN   : 1;            /*!< [5..5] TIM7 peripheral clock enable during CSleep mode                    */
      __IOM uint32_t TIM12LPEN  : 1;            /*!< [6..6] TIM12 peripheral clock enable during CSleep mode                   */
      __IOM uint32_t TIM13LPEN  : 1;            /*!< [7..7] TIM13 peripheral clock enable during CSleep mode                   */
      __IOM uint32_t TIM14LPEN  : 1;            /*!< [8..8] TIM14 peripheral clock enable during CSleep mode                   */
      __IOM uint32_t LPTIM1LPEN : 1;            /*!< [9..9] LPTIM1 Peripheral Clocks Enable During CSleep Mode                 */
            uint32_t            : 4;
      __IOM uint32_t SPI2LPEN   : 1;            /*!< [14..14] SPI2 Peripheral Clocks Enable During CSleep Mode                 */
      __IOM uint32_t SPI3LPEN   : 1;            /*!< [15..15] SPI3 Peripheral Clocks Enable During CSleep Mode                 */
      __IOM uint32_t SPDIFRXLPEN : 1;           /*!< [16..16] SPDIFRX Peripheral Clocks Enable During CSleep Mode              */
      __IOM uint32_t USART2LPEN : 1;            /*!< [17..17] USART2 Peripheral Clocks Enable During CSleep Mode               */
      __IOM uint32_t USART3LPEN : 1;            /*!< [18..18] USART3 Peripheral Clocks Enable During CSleep Mode               */
      __IOM uint32_t UART4LPEN  : 1;            /*!< [19..19] UART4 Peripheral Clocks Enable During CSleep Mode                */
      __IOM uint32_t UART5LPEN  : 1;            /*!< [20..20] UART5 Peripheral Clocks Enable During CSleep Mode                */
      __IOM uint32_t I2C1LPEN   : 1;            /*!< [21..21] I2C1 Peripheral Clocks Enable During CSleep Mode                 */
      __IOM uint32_t I2C2LPEN   : 1;            /*!< [22..22] I2C2 Peripheral Clocks Enable During CSleep Mode                 */
      __IOM uint32_t I2C3LPEN   : 1;            /*!< [23..23] I2C3 Peripheral Clocks Enable During CSleep Mode                 */
            uint32_t            : 3;
      __IOM uint32_t HDMICECLPEN : 1;           /*!< [27..27] HDMI-CEC Peripheral Clocks Enable During CSleep Mode             */
            uint32_t            : 1;
      __IOM uint32_t DAC12LPEN  : 1;            /*!< [29..29] DAC1/2 peripheral clock enable during CSleep mode                */
      __IOM uint32_t USART7LPEN : 1;            /*!< [30..30] USART7 Peripheral Clocks Enable During CSleep Mode               */
      __IOM uint32_t USART8LPEN : 1;            /*!< [31..31] USART8 Peripheral Clocks Enable During CSleep Mode               */
    } bit;
  } C1_APB1LLPENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000174) RCC APB1 High Sleep Clock Register                         */
    
