ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h
    struct {
      __IOM uint32_t PRI_4      : 8;            /*!< [7..0] Priority of system handler 4                                       */
      __IOM uint32_t PRI_5      : 8;            /*!< [15..8] Priority of system handler 5                                      */
      __IOM uint32_t PRI_6      : 8;            /*!< [23..16] Priority of system handler 6                                     */
            uint32_t            : 8;
    } bit;
  } SHPR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) System handler priority registers                          */
    
    struct {
            uint32_t            : 24;
      __IOM uint32_t PRI_11     : 8;            /*!< [31..24] Priority of system handler 11                                    */
    } bit;
  } SHPR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) System handler priority registers                          */
    
    struct {
            uint32_t            : 16;
      __IOM uint32_t PRI_14     : 8;            /*!< [23..16] Priority of system handler 14                                    */
      __IOM uint32_t PRI_15     : 8;            /*!< [31..24] Priority of system handler 15                                    */
    } bit;
  } SHPR3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) System handler control and state register                  */
    
    struct {
      __IOM uint32_t MEMFAULTACT : 1;           /*!< [0..0] Memory management fault exception active bit                       */
      __IOM uint32_t BUSFAULTACT : 1;           /*!< [1..1] Bus fault exception active bit                                     */
            uint32_t            : 1;
      __IOM uint32_t USGFAULTACT : 1;           /*!< [3..3] Usage fault exception active bit                                   */
            uint32_t            : 3;
      __IOM uint32_t SVCALLACT  : 1;            /*!< [7..7] SVC call active bit                                                */
      __IOM uint32_t MONITORACT : 1;            /*!< [8..8] Debug monitor active bit                                           */
            uint32_t            : 1;
      __IOM uint32_t PENDSVACT  : 1;            /*!< [10..10] PendSV exception active bit                                      */
      __IOM uint32_t SYSTICKACT : 1;            /*!< [11..11] SysTick exception active bit                                     */
      __IOM uint32_t USGFAULTPENDED : 1;        /*!< [12..12] Usage fault exception pending bit                                */
      __IOM uint32_t MEMFAULTPENDED : 1;        /*!< [13..13] Memory management fault exception pending bit                    */
      __IOM uint32_t BUSFAULTPENDED : 1;        /*!< [14..14] Bus fault exception pending bit                                  */
      __IOM uint32_t SVCALLPENDED : 1;          /*!< [15..15] SVC call pending bit                                             */
      __IOM uint32_t MEMFAULTENA : 1;           /*!< [16..16] Memory management fault enable bit                               */
      __IOM uint32_t BUSFAULTENA : 1;           /*!< [17..17] Bus fault enable bit                                             */
      __IOM uint32_t USGFAULTENA : 1;           /*!< [18..18] Usage fault enable bit                                           */
            uint32_t            : 13;
    } bit;
  } SHCRS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Configurable fault status register                         */
    
    struct {
      __IOM uint32_t IACCVIOL   : 1;            /*!< [0..0] IACCVIOL                                                           */
      __IOM uint32_t DACCVIOL   : 1;            /*!< [1..1] DACCVIOL                                                           */
            uint32_t            : 1;
      __IOM uint32_t MUNSTKERR  : 1;            /*!< [3..3] MUNSTKERR                                                          */
      __IOM uint32_t MSTKERR    : 1;            /*!< [4..4] MSTKERR                                                            */
      __IOM uint32_t MLSPERR    : 1;            /*!< [5..5] MLSPERR                                                            */
            uint32_t            : 1;
      __IOM uint32_t MMARVALID  : 1;            /*!< [7..7] MMARVALID                                                          */
      __IOM uint32_t IBUSERR    : 1;            /*!< [8..8] Instruction bus error                                              */
      __IOM uint32_t PRECISERR  : 1;            /*!< [9..9] Precise data bus error                                             */
      __IOM uint32_t IMPRECISERR : 1;           /*!< [10..10] Imprecise data bus error                                         */
      __IOM uint32_t UNSTKERR   : 1;            /*!< [11..11] Bus fault on unstacking for a return from exception              */
      __IOM uint32_t STKERR     : 1;            /*!< [12..12] Bus fault on stacking for exception entry                        */
      __IOM uint32_t LSPERR     : 1;            /*!< [13..13] Bus fault on floating-point lazy state preservation              */
            uint32_t            : 1;
      __IOM uint32_t BFARVALID  : 1;            /*!< [15..15] Bus Fault Address Register (BFAR) valid flag                     */
      __IOM uint32_t UNDEFINSTR : 1;            /*!< [16..16] Undefined instruction usage fault                                */
      __IOM uint32_t INVSTATE   : 1;            /*!< [17..17] Invalid state usage fault                                        */
      __IOM uint32_t INVPC      : 1;            /*!< [18..18] Invalid PC load usage fault                                      */
      __IOM uint32_t NOCP       : 1;            /*!< [19..19] No coprocessor usage fault.                                      */
            uint32_t            : 4;
      __IOM uint32_t UNALIGNED  : 1;            /*!< [24..24] Unaligned access usage fault                                     */
      __IOM uint32_t DIVBYZERO  : 1;            /*!< [25..25] Divide by zero usage fault                                       */
            uint32_t            : 6;
    } bit;
  } CFSR_UFSR_BFSR_MMFSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Hard fault status register                                 */
    
