ckormanyos/real-time-cpp/ref_app/src/mcal/stm32h7a3/STM32H7x3.h
    struct {
            uint32_t            : 1;
      __IOM uint32_t VECTTBL    : 1;            /*!< [1..1] Vector table hard fault                                            */
            uint32_t            : 28;
      __IOM uint32_t FORCED     : 1;            /*!< [30..30] Forced hard fault                                                */
      __IOM uint32_t DEBUG_VT   : 1;            /*!< [31..31] Reserved for Debug use                                           */
    } bit;
  } HFSR;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Memory management fault address register                   */
    
    struct {
      __IOM uint32_t ADDRESS    : 32;           /*!< [31..0] Memory management fault address                                   */
    } bit;
  } MMFAR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Bus fault address register                                 */
    
    struct {
      __IOM uint32_t ADDRESS    : 32;           /*!< [31..0] Bus fault address                                                 */
    } bit;
  } BFAR;
} SCB_Type;                                     /*!< Size = 60 (0x3c)                                                          */



/** @} */ /* End of group Device_Peripheral_peripherals */

#ifdef __cplusplus
}
#endif

#define RCC_BASE   0x58024400UL
#define Flash_BASE 0x52002000UL
#define SCB_BASE   0xE000ED00UL

#define RCC   ((RCC_Type*)   RCC_BASE)
#define Flash ((Flash_Type*) Flash_BASE)
#define SCB   ((SCB_Type*)   SCB_BASE)

#endif /* STM32H7X3_H */
